package com.zlpay.enums.mall;


/** 
 * @Description: 应答码
 * @author: tsl
 * @date: 2020年8月14日 下午2:00:38  
 */
public enum MallRespCodeEnum {
	
	/** 
	* @Fields SUCCESS : 通用--成功
	*/ 
	SUCCESS("000000","成功"),
	/** 
	* @Fields FAIL : 通用--失败
	*/ 
	FAIL("000001","失败"),
	/** 
	* @Fields UNKNOWN : 通用--结果未知
	*/ 
	UNKNOWN("999999","结果未知"),
	
	/** 
	* @Fields F010001 : 报文参数类型错误
	*/ 
	F010001("010001","报文参数类型错误"),
	/** 
	 * @Fields F010002 : 重复交易
	 */ 
	F010002("010002","重复交易"),
	/**
	 * F010003 报文参数校验失
	 */
	F010003("010003","报文参数校验失败"),
	/**
	 * F010004 获取配置信息失败
	 */
	F010004("010004","获取配置信息失败"),
	/**
	 * F010005  业务验证失败
	 */
	F010005("010005","业务验证失败"),
	/**
	 * 010006  正在进行日终处理
	 */
	F010006("010006","正在进行日终处理，稍后再试"),
	F010007("010007","交易金额超限"),
	F010008("010008","客户信息不完整"),
	F010009("010009","查询账务日期失败"),
	/**
	 * F01024  订单不存在  订单出金模式使用，原F020025（原有功能已在使用）应答码长度不符合规范，故弃用
	 */
	F010024("010024","原交易订单不存在"),
	/**
	 * F01025  备案订单不存在
	 */
	F010025("010025","备案订单不存在"),
	F010026("010026","非平台商户，不允许该操作"),
	F010027("010027","风控校验不通过"),
	F010028("010028","不被允许的交易"),
	F010029("010029","超出可退金额"),
	F010030("010030","已结算订单不支持退款"),
	F010031("010031","参数缺失"),
	F010032("010032","原交易无优惠记录"),
	F010033("010033","原交易未分账，不支持分账退款"),
	F010034("010034","原交易已结算，不支持分账退款"),
	F010035("010035","商户自动退款注资失败"),
	F010036("010036","实名信息不可空"),
	F020001("020001","无此商户"),
	F020002("020002","商户状态无效"),
	F020003("020003","商户无交易权限"),
	F020004("020004","无此客户"),
	F020005("020005","客户状态无效"),
	F020006("020006","客户信息验证失败"),
	F020007("020007","银行卡不存在"),
	F020008("020008","卡状态无效"),
	F020009("020009","卡信息验证失败"),
	F020010("020010","商户客户关系验证失败"),
	F020011("020011","客户卡关系验证失败"),
	F020012("020012","短信验证失败"),
	F020013("020013","非VIP客户不允许新增银行卡"),
	F020014("020014","卡与商户关系校验失败"),
	F020015("020015","金额格式错误"),
	F020016("020016","账户余额不足"),
	F020017("020017","专户未添加收款账户白名单"),
	F020018("020018","白名单未审核通过"),
	F020019("020019","收款账户收款金额超限"),		
	F020034("020034", "当前订单状态不允许退款"),
	F020035("020035", "已存在处理中的退款订单"),
	F020036("020036", "退款金额大于可退款金额"),
	F020037("020037", "当前订单状态不允许取消"),
	F020038("020038", "入金核查未通过"),
	F020074("020074" ,"账户开立失败"),
	F020075("020075" ,"一次分账最多支持5个收款方"),
	F020076("020076" ,"获取分账信息失败"),
	F020077("020077" ,"分账请求已处理"),
	F020078("020078" ,"原订单不支持分账操作"),
	F020079("020079" ,"该卡未签约扣款协议"),
	F020080("020080" ,"不支持此种短信类型"),
	F020081("020081" ,"退款金额不可小于优惠退款或分账退款"),
	F020082("020082" ,"查询账户信息失败"),
	F020087("020087" ,"已结算的付款单，退款结算类型不支持与原单保持一致"),
	F020088("020088" ,"未结算的付款单，资金来源仅支持待结算资金"),
	F020089("020089" ,"未结算的付款单，多次退款的结算类型，需要一致"),
	F020090("020090" ,"退款优惠金额大于可退款优惠金额"),
	F020091("020091" ,"退款不支持只退用户实际支付部分"),
	F020092("020092" ,"退款不支持把优惠金额退给用户"),
	F020093("020093" ,"超过退款资金额度"),
	F020094("020094" ,"商户自有资金余额不足"),
	F020095("020095" ,"未申请分账退款，退款金额大于分帐后可退金额"),
	F020096("020096" ,"退款金额大于分帐后可退金额"),
	F020097("020097" ,"收佣商退款分账金额，大于原申请分账金额"),
	F020098("020098" ,"待结算资金退款，订单结算时间未明确"),
	F020099("020099" ,"无此专户查询权限"),
	F020100("020100" ,"客户类型不正确"),
	F110001("110001", "无效账户"),
	F110002("110002", "交易订单不支持跨平台"),
	F110003("110003", "订单结算时间延迟，不满足退款要求"),
	F020101("020101" ,"原交易订单类型不为预下单"),
	F020102("020102" ,"原交易订单状态不为待支付"),
	F020103("020103" ,"原交易订单未过有效期"),
	F020104("020104","原交易订单渠道状态不满足关单要求"),
	F020105("020101" ,"结算只支持企业客户（CB**）"),
	F020106("020106" ,"订单存在优惠，流水号长度不大于30位"),
	F020107("020107" ,"调用银行渠道关单失败"),
	F020108("020108" ,"合单订单不支持关单操作"),
	F020109("020109" ,"订单为非待分账状态，不可取消"),
	
	
	
	F020039("F020039" , "结算日期格式错误"),
	F020020("F020020" ,"流水号已存在"),
	F020021("F020021" ,"账户余额不足"),
	F020022("F020022" ,"支付系统异常处理中"),
	F020023("F020023" ,"支付系统处理失败"),
	F020024("F020024" ,"获取计费方式异常"),
	F020025("F020025" ,"原交易订单不存在"),
	F020026("F020026" ,"原交易订单处理中"),
	F020027("F020027" ,"原交易订单交易失败"),
	F020028("F020028" ,"原单已退款完成,不允许重复发起退款"),
	F020029("F020029" ,"退款金额大于原单金额"),	
	F020030("F020030" ,"查询商户信息失败"),	
	F020031("F020031" ,"查询商户确认订单信息失败"),	
	F020032("F020032" ,"证联与网联终态通知结果相悖，且未做处理"),	
	F020033("F020033" ,"获取银行账户失败"),
	F020040("F020040" , "结算日期小于当前日期"),
	F020041("F020041" , "暂不支持快捷支付"),
	F020042("F020042" , "不能使用信用卡"),
	F020043("F020043" , "分账金额必须大于0"),
	F020044("F020044" , "分账商户号不能为空"),
	F020045("F020045" , "收单商户与分账商户相同"),
	F020046("F020046" , "分账商户重复"),
	F020047("F020047" , "不支持跨平台分账"),
	F020048("F020048" , "分账总金额不能大于或等于订单金额"),
	F020049("F020049" , "原交易已结算"),
	F020050("F020050" , "原单不存在分账信息"),
	F020051("F020051" , "分账金额不能大于原分账金额"),
	F020052("F020052" , "分账商户号与原单不符"),
	F020053("F020053" ,"原单已退款完成，不允许重复发起退款"),
	F020054("F020054" ,"退款金额大于可退金额"),
	F020055("F020055" ,"原交易已结算"),
	F020056("F020056" ,"数据格式错误"),
	F020057("F020057" ,"二要素鉴权失败"),
	F020058("F020058" ,"查询客户基础信息是否完整失败"),
	F020059("F020059" ,"交易超限"),
	F020060("F020060" ,"免密支付失败，未签约"),
	F020061("F020061" ,"免密支付失败，协议号错误"),
	F020062("F020062" ,"免密支付失败，单笔限额超限"),
	F020063("F020063" ,"免密支付失败，日累计次数超限"),
	F020064("F020064" ,"免密支付失败，日累计限额超限"),
	F020065("F020065" ,"免密支付失败，月累计限额超限"),
	F020066("F020066" ,"短信验证码业务类型错误"),
	F020067("F020067" ,"次日的15点后生成电子回单"),
	F020068("F020068" ,"订单状态不符合"),
	F020069("F020069" ,"订单超时"),
	F020070("F020070" ,"密码错误"),
	F020071("F020071" ,"免密支付失败，暂无可用免密扣款方式"),
	F020072("F020072" ,"不支持的证件类型"),
	F020073("F020073" ,"已过可退款期限"),
	F020083("F020083" ,"获取支付参数失败"),
	F020084("F020083" ,"账单不存在"),
	F020085("F020085" ,"退款金额和可退金额不一致，不允许退款！"),
	F020086("F020086" ,"可退金额为0,不允许发起退款！"),
	
	
	
	
	//文件上传相关
	F030001("F030001", "摘要值校验失败"),
	F030002("F030002", "文件解密失败"),
	F030003("F030003", "文件大小超过限制"),

	//红包
	F040001("F040001" ,"剩余可取额度不足"),
	F040002("F040002" ,"撤销金额与实际剩余金额不符"),
	F040003("F040003" ,"交易类型错误"),
	F040004("F040004" ,"客户信息不一致"),
	F040005("F040005" ,"转账收付款与付款方客户相同"),
	F040006("F040006" ,"转账收款方未开通余额账户"),
	F040007("F040007" ,"转账付款方未开通余额账户"),
	F040008("F040008" ,"该交易类型不支持退款"),
	
	// 应答网联动账通知时特殊使用
	OTHER("09","其它原因"),
	;

	private String value;//应答编码
	private String displayName;//应答码含义
	
	MallRespCodeEnum(String value,String displayName) {
		this.value = value;
		this.displayName = displayName;
	}
	
	public String getValue() {
		return value;
	}
	public void setValue(String value) {
		this.value = value;
	}
	public String getDisplayName() {
		return displayName;
	}
	public void setDisplayName(String displayName) {
		this.displayName = displayName;
	}
}
