package com.zlpay.enums.payacc;



/** 
 * @Description: 应答码长度7位，分为四段
				第一段为第一个字母，由S，F，P三个字母组成，分别代表成功，失败，处理中；
				第二段由第二和第三个字符组成，代表系统编码,前置（01）
				第三段由第四和第五个字符组成，代表功能编码；
				第四段由第六位和第七个字符组成，代表某一类功能的详细应答码；
 * @author: lxy
 * @date: 2020年1月7日 上午11:35:00
 */
public enum PayAccRespCodeEnum {
	/**
	 * 通用（成功）
	 */
	SUCESS("S010000","成功"),
	/**
	 * 通用（处理中）
	 */
	P010001("P010001","处理中"),
	/**
	 * 系统发生未知异常
	 */
	P019999("P019999", "系统发生未知异常"),
	/**
	 * 会话超时
	 */
	F010000("F010000","会话超时"),
	/**
	 * 通用（失败）
	 */
	F010001("F010001","操作失败！"),
	/**
	 * 通用（解密验签失败）
	 */
	F010002("F010002","解密验签失败"),
	/**
	 * 通用（加密加签失败）
	 */
	F010003("F010003","加密加签失败"),
	/**
	 * 通用（流水号已存在）
	 */
	F010004("F010004","流水号冲突"),
	/**
	 * 通用（不支持的业务代码）
	 */
	F010005("F010005","不支持的业务代码"),
	/**
	 * 通用（管理平台系统参数未配置）
	 */
	F010006("F010006","管理平台系统参数未配置"),
	/**
	 * 通用（Redis缓存随机数失效）
	 */
	F010007("F010007","会话超时，请刷新"),
	/**
	 * 重复请求
	 */
	F010008("F010008","请求频率过快，请稍后再试！"),
	/**
	 * 报文格式校验
	 */
	F010100("F010100","报文格式错误"),
	/**
	 * 请求报文解析
	 */
	F010200("F010200","解析报文失败："),
	F010203("F010203","摘要验证失败"),
	
	/**
	 * 业务模块-申请token
	 */
	F010300("F010300","接入方状态异常！"),
	F010301("F010301","非法IP地址！"),
	F010302("F010302","收款方未开通余额！"),
	F010303("F010303","预下单失败！"),
	F010304("F010304","转账收款方未开通余额账户"),
	F010305("F010305","转账付款方未开通余额账户"),
	F010306("F010306","非法参数！"),
	/**
	 * 业务模块-验证token
	 */
	F010400("F010400","token状态无效！"),
	F010401("F010401","token持有方异常！"),
	F010402("F010402","token已失效！"),
	F010403("F010403","token持有方用户异常！"),
	F010404("F010404","token持有方用户设备异常！"),
	F010405("F010405","非法token！"),
	F010406("F010406","该用户已存在！"),
	F010407("F010407","该用户不存在！"),
	F010408("F010408","密码错误！"),
	F010409("F010409","该用户状态异常！"),
	F010410("F010410","token信息为空！"),
	F010411("F010411","IP地址不一致！"),
	F010412("F010412","无IP信息"),
	F010413("F010413","收款客户与付款客户相同"),

	/**
	 * 业务模块-主扫支付
	 */
	F010500("F010500","无法识别的二维码！"),
	F010501("F010501","该用户未绑卡！"),
	F010502("F010502","用户状态异常！"),
	F010503("F010503","用户订单不存在！"),
	F010504("F010504","付款金额异常！"),
	F010505("F010505","查询营销信息失败！"),
	F010506("F010506","订单不能重复支付！"),
	F010507("F010507","收款码域名异常！"),
	F010508("F010508","未开通线下支付！"),
	F010509("F010509","退款失败！原订单不存在"),
	F010510("F010510","申请二维码失败"),
	F010511("F010511","二维码失效或不存在"),
	F010512("F010512","二维码与用户信息不匹配"),

	/**
	 * 业务模块-用户银行卡
	 */
	F010600("F010600","用户银行卡不存在"),
	F010601("F010601","二维码对应银行卡信息不存在"),
	F010602("F010602","新增银行卡失败"),
	F010603("F010603","查询银行卡列表失败"),
	F010604("F010604","设置银行卡扣款顺序失败"),
	F010605("F010605","查询银行卡失败"),
	F010606("F010606","更新银行卡失败"),
	F010607("F010607","信用卡关键参数不能为空"),
	F010608("F010608","删除银行卡失败"),
	F010609("F010609", "查询余额失败"),
	F010610("F010610", "验证未通过，请重试！"),
	F010611("F010611", "根据卡号查询卡信息失败"),
	F010612("F010612", "暂不支持此卡类型"),
	F010613("F010613", "该卡已绑定"),
	F010614("F010614", "短信验证码已失效，请重新获取"),
	F010615("F010615", "卡状态异常"),
	F010616("F010616", "用户和银行卡信息不匹配"),
	F010617("F010617", "当前账户无可用银行卡，请联系客服处理"),
	F010618("F010618", "暂不支持当前银行"),
	F010619("F010619", "卡token不正确"),
	F010620("F010620", "当前银行卡存在免密支付/自动扣款协议，请解约后重试"),

	/**
	 * 业务模块-密码相关
	 */
	F010700("F010700","密码输入错误"),
	F010701("F010701","两次输入密码不一致"),
	F010702("F010702","密码不能为连续、重复数字或生日"),
	F010703("F010703","新密码不能和原密码相同"),
	F010704("F010704","支付密码错误次数过多，请1小时后重试！"),
	F010705("F010705","密码控件解密失败！"),
	F010706("F010706","请输入包含数字和字母的8-16位密码！"),
	F010707("F010707","登录密码错误次数过多，已锁定！"),
	F010708("F010708","操作超时！"),
	F010709("F010709","手机号非当前用户！"),

	/**
	 * 业务模块-被扫支付
	 */
	F010800("F010800","二维码信息不存在"),
	F010801("F010801","推送客户端消息失败"),
	F010802("F010802","获取用户通信对象失败"),
	F010803("F010803","二维码已失效"),
	F010804("F010804","新增二维码失败"),
	F010805("F010805","查询二维码失败"),
	F010806("F010806","修改二维码信息失败"),
	F010807("F010807","获取二维码失败"),
	F010808("F010808","查询订单信息失败"),
	F040101("F040101","申请二维码"),
	
	/**
	 * 业务模块-用户模块
	 */
	F010900("F010900","用户信息不存在"),
	F010901("F010901","查询用户信息失败"),
	F010902("F010902","用户未开通余额账户"),
	F010903("F010903","该证件号码已注册"),
	F010904("F010904","商户客户关系验证失败"),
	F010905("F010905","客户信息有误"),
	F010906("F010906","手机号未注册"),
	F010907("F010907","手机号已注册"),
	F010908("F010908","您已实名注册，请使用原手机号进行登录"),
	F010909("F010909","信息验证失败，请重试"),
	F010910("F010910", "未被允许的手机号码"),
	F010911("F010911", "未查询到短信记录"),
	F010912("F010912", "手机号与户名不匹配!"),
	F010913("F010913", "账号与户名不匹配!"),
	F010914("F010914", "用户状态异常"),
	F010915("F010915", "账户余额不为0"),
	F010916("F010916", "该账号不存在"),
	F010917("F010917", "手机号码异常"),
	F010918("F010918", "该用户已开通余额账户"),
	F010919("F010919", "客户号不正确"),
	F010920("F010920", "无微信支付权限"),
	F010921("F010921", "无云闪付支付权限"),
	F010922("F010922", "客户名称不能为空"),
	/**
	 * 业务模块-用户日志
	 */
	F011100("F011100","查询用户日志信息失败"),
	
	/**
	 * 系统间接口调用异常
	 */
	F011000("F011000","接口调用发生熔断异常！"),
	F011001("F011001","未查询到商户信息！"),

	/**
	 * 业务模块-app状态判断
	 */
	F011200("F011200", "app状态异常！"),
	F011201("F011201", "appId不存在！"),

	/**
	 * 业务模块-免密协议
	 */
	F011300("F011300","暂无扣费服务！"),
	F011301("F011301","无效的协议号！"),
	F011302("F011302","免密/委托代扣服务已签约！"),
	F011303("F011303","订单金额超出免密额度！"),
	F011304("F011304","无可用免密支付扣款方式！"),
	F011305("F011305","申请签约用户与当前用户实名信息不符！"),
	F011306("F011306","备案编号不存在或者无效！"),
	F011307("F011307","扣款周期不存在/服务费用错误！"),
	F011308("F011308","下次扣款时间错误！"),
	F011309("F011309","备案编号主体错误！"),
	F011310("F011310","扣款金额超过协议限额！"),

	/**
	 * 业务模块-交易
	 */
	F020000("F020000", "密码错误"),
	F020001("F020001", "结果未知"),
	F020002("F020002", "查询交易总金额异常"),
	F020003("F020003", "查询客户信息异常"),
	F020004("F020004", "应反洗钱监管要求，请完善客户信息后重试"),
	F020005("F020005", "金额最小为1分"),
	F020006("F020006", "该交易不支持代付"),
	F020007("F020007", "交易失败"),
	F020008("F020008", "交易处理中"),
	F020009("F020009", "银联线上预下单失败"),
	F020010("F020010", "交易金额不可为0"),
	F020011("F020011", "余额不足"),
	F020012("F020012", "交易金额不可为空"),
	F020013("F020013", "交易金额过大，已拦截"),


	/**
	 * OCR
	 */
	F030001("F030001", "证件信息与注册信息不符"),
	F030002("F030002", "证件照片识别失败"),

	/**
	 * 支付账户
	 */
	F040001("F040001", "余额不为0"),

	/**
	 * 消费风控
	 */
	F050001("F050001", "风控系统拦截，暂不支持当前操作"),
	F050002("F050002", "步骤码校验失败！"),

	/**
	 * 手机盾
	 */
	F060001("F060001", "当前设备不存在有效证书！"),
	F060002("F060002", "当前设备证书已过期！"),

	/**
	 * 旷世人脸识别
	 */
	F070001("F070001", "身份信息验证失败！")
	;

	/**
	 * 响应码
	 */
	private String value;
	/**
	 * 响应描述
	 */
	private String displayName;
	
	PayAccRespCodeEnum(String value, String displayName){
		this.value = value;
		this.displayName = displayName;
	}

	public String getValue() {
		return value;
	}

	public void setValue(String value) {
		this.value = value;
	}

	public String getDisplayName() {
		return displayName;
	}

	public void setDisplayName(String displayName) {
		this.displayName = displayName;
	}
	public static boolean isFail(String respCode) {
		if(respCode.startsWith("F")) {
			return true;
		}else {
			return false;
		}
	}
	public static boolean isProcess(String respCode) {
		if(respCode.startsWith("P")) {
			return true;
		}else {
			return false;
		}
	}
}